docs/posts/2018-08-07-benediction-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Benediction</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Benediction</h1>
<p class="subtitle" role="doc-subtitle">Aug 07, 2018</p>
</header><p>
In <i>The Brothers Karamazov</i>, Dostoevsky uses the slanting rays of the sun to represent the love of God that can flow through each of us, transforming lives as we interact with each other with genuine love.
</p>

<p>
Now, may the slanting rays of the sun light the path before us, as the love of God surrounds us, to guide us on our journey. May God guard our hearts from anything that might separate us, and shelter us all in his love, forever.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="orgeb20e06">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
